// src/pages/Home/Home.tsx

import React from 'react';

import './History.css';

const History = () => {
  return (
    <main>

      <div
        className="banner"
        style={{ backgroundImage: 'url(/images/baner-foto.webp)' }}
      >
        <p className="banner-text">Вінничина
        <p>Це більше, ніж просто регіон — це місце, де історія, природа та сучасні технології зустрічаються в одному маршруті. 
          Ми створюємо інноваційні цифрові ресурси, щоб зробити подорож Вінниччиною зручною, цікавою та доступною кожному. 
          Відкрий її туристичний потенціал онлайн — і заплануй свою подорож уже сьогодні!</p></p>
      </div>





      <div className="audio-gallery-wrapper">
        <audio controls>
          <source src="/audio/history-.mp3" type="audio/mpeg" />
          Your browser does not support the audio element.
        </audio>
        <p className="audio-caption">
            На сайті є аудіо, що відповідають тексту. Ви можете читати або прослуховувати текст.
      </p>
        </div>
      
      <section className="about-vinnytsia">
      <h2>Історія нашого краю</h2>

      <p>
        На території, займаній сучасною Вінницею, людина селилася з незапам'ятних часів. 
        Археологи знайшли тут знаряддя праці епохи неоліту, поховання бронзової доби, слов'янські поселення, 
        що належали до черняхівської культури; пізніше тут жили племена, що входили до складу Київської Русі, 
        Галицько-Волинського князівства.
      </p>

      <p>
        З географічної точки зору територія Вінницької області — це землі, що лежать у середній течії Південного Бугу, або, 
        по-старому, Богу, званого в Геродота Гіпанісом.
      </p>

      <p>
        У літописні часи, за Нестором, «Уличі і тиверці сиділи по Дністру і з'єднали з Дунаєм. Була їх множина». 
        Пізніше київський князь Олег, розширюючи володіння, стягував данину й володарював «над полянами, і древлянами, і мешканцями 
        півночі, і радимичами, а з уличами і тиверцями воював», як повідомляє «Повість временних літ» під 885 роком. Незабаром Середнє 
        Побужжя увійшло до складу Київської Русі, 
        і вже в 907 році у відомий похід на Царгород Олег узяв із собою «тиверців, відомих як товмачі».
      </p>

      <p>
        У період феодальної роздробленості Київської Русі ці землі ввійшли до складу Галицько-Волинського князівства. 
        Оскільки стольні міста цього князівства, Володимир і Галич, розташовувалися перший на північ від басейну річки Дністер, 
        а другий — у верхній її течії, то землі, що лежали 
        на південь від них, у нижній течії безлічі лівих приток Дністра, одержали назву Пониззя.
      </p>

      <p>
        Коли ж у 1240 році під ударами орд Батия впав Київ, татарські завойовники рушили на захід і 
        незабаром удерлися в Поділля — так з тих часів стало називатися Пониззя. Не знайшовши в західних 
        сусідів допомоги й підтримки в боротьбі з нашестям, галицько-волинський князь Данило Романович вимушений 
        був визнати залежність від Золотої Орди. Татари розділили на тьми Подільський улус, брали з нього данину, 
        а самі кочували в Дикому полі — в степах на південь від річок Ягорлик, Синюха, Тясьмин.
        
      </p>

    </section>
    <div className="audio-gallery-wrapper">
       
        <div className="carousel">
          <img src="/images/h1.png" alt="1" />
          <img src="/images/h2.png" alt="2" />
          <img src="/images/h3.png" alt="3" />
        </div>
     
    </div>

    


    <div className="audio-gallery-wrapper">
        <audio controls>
          <source src="/audio/history-2.mp3" type="audio/mpeg" />
          Your browser does not support the audio element.
        </audio>
        <p className="audio-caption">
            На сайті є аудіо, що відповідають тексту. Ви можете читати або прослуховувати текст.
      </p>
        </div>
      
      <section className="about-vinnytsia">
      <p>
        Уздовж меж Дикого поля брати звели замки для захисту від набігів неспокійних південних сусідів. Ці замки й 
        з'явилися основою для зростання таких міст, як Вінниця, Черлений град, Брацлав, Ров-Бар та інші. Звичайно, поселення 
        в цих зручних для життя й оборони місцевостях існували задовго до приходу Коріятовичів, що підтверджується археологічними 
        даними. Проте початок згаданих міст відноситься до 1362—1363 років.
      </p>

      <p>
        Заснування Вінниці пов'язане з ім'ям Ольгердового племінника Федора Коріятовича. У 1363 році він заклав дерев'яну 
        фортецю на високій кручі, нижче впадання в Буг лівої його притоки — річки Віннички. Урочище Замкова гора, обернене років 
        сто тому в каменоломні, в 1890 році зникло зовсім, перетворившись у фундаменти міських будинків і бруківку. Назва «Вінниця» 
        зустрічається вже в документі, підписаному 13 червня 1385 року в Кракові королем Владиславом Ягеллоном. З багатьох версій, що 
        пояснюють назву міста, мабуть, найімовірніші ті, що ґрунтуються на таких словах: «вінниця» — винокурня, 
        де варилося пиво винне, старослов'янське «вѣно» — посаг, придане, одержане Коріатовичами, і Вінничка — річка.
      </p>

      <p>
        Невеликий дерев'яний замок у ряді інших степових зміцнень, звичайно, не радував ординців. З 1400 по 1569 рік він 
        піддавався тридцять разів тільки великим нападам, горів і знову вставав над Бугом.
      </p>

      <p>
        Після Кревської унії 1385 року, що об'єднала Польщу і Литву, що охрестилася, у 1434 році подільські землі 
        аж до річки Мурафи було підпорядковано безпосередньо польській короні, тут було утворено Подільське воєводство. 
        Середнє Побужжя залишилося під владою Литви, тут було утворено 
        Брацлавське воєводство, або коротко, за головним містом — Брацлавщину.
      </p>    
      </section>



      <div className="audio-gallery-wrapper">
        <audio controls>
          <source src="/audio/history-3.mp3" type="audio/mpeg" />
          Your browser does not support the audio element.
        </audio>
        <p className="audio-caption">
            На сайті є аудіо, що відповідають тексту. Ви можете читати або прослуховувати текст.
      </p>
        </div>
      
      <section className="about-vinnytsia">
      <p>
        У другій половині XV століття Вінниця за привілеєм Олександра Казимировича вже користувалася магдебурзьким 
        правом. Самоврядування здійснювалося виборним магістратом, куди входила рада — рада з восьми чоловік на чолі з бургомістром, 
        лава — суд з п'яти лавників з війтом на чолі й ґміна з дванадцяти чоловік. Ремісники об'єднувалися в цехи, а в Краєзнавчому 
        музеї можна побачити старовинні цехові знаки. Швидкому зростанню економічного значення міста сприяв також торговий тракт з 
        Молдови до Москви. За часів Івана III між двома державами зав'язалися активні торгові зв'язки. У XVI сторіччі почастішали 
        набіги кримчан на подільські землі, і вінницький замок деколи вже не вміщав тих, що всіх прагнули в ньому сховатися. 
        У 1541 році татари особливо жорстоко 
        спустошили околиці Вінниці й захопили багато полонених, яких, правда, вдалося відбити.
      </p>

      <p>
        У 1558 році звели новий замок на більш неприступних земляних валах острівця Кемпа, лежачого проти правобережного горба, 
        що огинається Бугом. Але цей замок також був дерев'яним, 
        і в 1580 році його спалили татари. У вогні загинули всі даровані місту грамоти, а з ними і без того куці права міщан.
      </p>

      <p>
        На одностайне прохання місцевої шляхти, за Люблінською унією 1569 року Брацлавщина перейшла під владу Речі Посполитої.
      </p>

      <p>
        У 1598 році до Вінниці були переведені всі урядові установи, і вона стала столицею Брацлавського воєводства, тому що 
        Брацлав ще частіше піддавався нападам татар, та і неспокійна Запорізька Січ знаходилася близько. Це зумовило наступний 
        етап зростання Вінниці — забудову правого берега Бугу. Нове розташування замку, що зайняв найважливіше місце в структурі 
        міста, сформувало і планувальну мережу вулиць Правобережжя, пучком тих, що сходяться до моста, пізніше перекинутого на замковий 
        острів Кемпа, а з нього — на лівий берег. Ця схема вулиць існує і нині.
      </p>    
      </section>
      <div className="audio-gallery-wrapper">
       
        <div className="carousel">
          <img src="/images/h4.jpg" alt="1" />
          <img src="/images/h5.jpg" alt="2" />
          <img src="/images/h6.png" alt="3" />
        </div>
     
    </div>


      <div className="audio-gallery-wrapper">
        <audio controls>
          <source src="/audio/history-4.mp3" type="audio/mpeg" />
          Your browser does not support the audio element.
        </audio>
        <p className="audio-caption">
            На сайті є аудіо, що відповідають тексту. Ви можете читати або прослуховувати текст.
      </p>
        </div>
      <section className="about-vinnytsia">
      <p>
        Після Андрусівського перемир'я 1667 роки Брацлавщина, як і вся Правобережна Україна, залишилася під владою польської корони. 
        Проте шляхетська Польща настільки слабшала, що не змогла встояти перед натиском Високої Порти і за Бучацьким миром 1672 року віддала туркам 
        значну частину Подільського, Брацлавського і Київського воєводств. Трактат «Про вічний мир» 1686 року повернув Польщі все Правобережжя, правда 
        формально. Тож двадцять сім років, до 1699 року, володарювало на цих землях створене турками та очолюване їхніми ставлениками Петром Дорошенком, 
        Юрієм Хмельницьким та 
        іншими «князівство Сармата», і розтерзаний війнами край перетворився на пустелю, що роздирається внутрішніми суперечностями.
      </p>

      <p>
        Польська держава розхитувалася під ударами конфедерацій власної шляхти, поки не розсипалася, тричі розділена між могутніми сусідніми монархіями — Росією, 
        Австрією і Пруссією. Боротьба конфедератів проти царських військ продовжувалася з 1768 до 1772 року. У жовтні 1768 на стороні Барської конфедерації виступила 
        Туреччина, яка оголосила війну Росії. Французький уряд для керівництва збройними силами конфедератів вислав генерала Дюмур'є. Однак, попри значну міжнародну 
        підтримку, в 1772 році головні сили конфедератів були розбиті російськими військами під командуванням О. Суворова. Поразка Барської конфедерації стала однією 
        з передумов першого поділу Польщі в 1772 році. Після другого розділу 1793 року Поділля і Брацлавщина відійшли до 
        Росії та утворили Подільську губернію, до західної частини губернії увійшло власне Подільське воєводство, в східну — Брацлавське воєводство.
      </p>

      <p>
        Після приєднання Поділля до Росії Вінниця стала губернським містом, але після установи Подільської губернії з центром в Кам'янці була переведена в штат повітового 
        міста. Розвиток Вінниці пішов набагато швидшим після споруди в 1870 році поблизу міста залізниці Київ — 
        Балта — Одеса. З'явилися фабрики та заводи, в місті стали будувати кам'яні будівлі.
      </p>

      <p>
        31 жовтня — 1 листопада 1921 р., під час Листопадового рейду, через Літинський та Хмільницький райони теперішньої Вінницької області проліг шлях Подільської групи 
        (командувач Михайло Палій-Сидорянський) Армії Української Народної Республіки.
      </p>    
      </section>




      <div className="audio-gallery-wrapper">
        <audio controls>
          <source src="/audio/history-5.mp3" type="audio/mpeg" />
          Your browser does not support the audio element.
        </audio>
        <p className="audio-caption">
            На сайті є аудіо, що відповідають тексту. Ви можете читати або прослуховувати текст.
      </p>
        </div>
      
      <section className="about-vinnytsia">
      <h2>УРСР</h2>
      <p>
        Вінницька область була заснована 27 лютого 1932 року. Тоді вона займала території нинішніх Вінницької, Хмельницької, 
        частини Житомирської області, і до її складу ввійшли 2 міста (Вінниця і Бердичів) та 71 район. Але в 1937 році, після утворення 
        Кам'янець-Подільської та Житомирської областей, у складі 
        Вінницької області залишається два міста обласного підпорядкування — Вінниця і Могилів-Подільський та 42 райони.
      </p>
    </section>


    <div className="audio-gallery-wrapper">
        <audio controls>
          <source src="/audio/history-6.mp3" type="audio/mpeg" />
          Your browser does not support the audio element.
        </audio>
        <p className="audio-caption">
            На сайті є аудіо, що відповідають тексту. Ви можете читати або прослуховувати текст.
      </p>
        </div>
      
      <section className="about-vinnytsia">
      <h2>Друга світова війна</h2>
      <p>
       Під час другої світової війни в липні 1941 року область була окупована німецькими та румунськими військами. Усьому 
       народному господарству було завдано великих збитків — спалено 14 сіл, спалено та зруйновано 25909 будинків, 1586 шкіл, 22 технікуми, 148 клубів, 
       театрів і музеїв, 236 бібліотек, 236 лікарень і амбулаторій, 41 дитячий заклад, зруйновано або знищено 1939 колгоспів, 376 промислових підприємств, 
       знищено або вивезено до Німеччини 101367 сільськогосподарських машин. До того ж на примусові роботи вивезено 74344 мирних громадян. Область звільнена у 
       березні 1944 року. 137 вінничан 
       у роки Другої Світової війни за проявлений героїзм відзначені найвищою нагородою — звання Героя Радянського Союзу.
      </p>
    </section>
      
    </main>
  );
};

export default History;